# Table of Contents
 <p><div class="lev1"><a href="#Import-pandas,-numpy,-matplotlib-and-seaborn"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas, numpy, matplotlib and seaborn</a></div><div class="lev1"><a href="#Create-a-Series-object,-access-it's-index-and-cells"><span class="toc-item-num">2&nbsp;&nbsp;</span>Create a Series object, access it's index and cells</a></div><div class="lev1"><a href="#Create-a-DataFrame-object,-access-its-rows,-columns,-indices,-cells"><span class="toc-item-num">3&nbsp;&nbsp;</span>Create a DataFrame object, access its rows, columns, indices, cells</a></div><div class="lev1"><a href="#Data-Import"><span class="toc-item-num">4&nbsp;&nbsp;</span>Data Import</a></div><div class="lev1"><a href="#DataFrame-filtering"><span class="toc-item-num">5&nbsp;&nbsp;</span>DataFrame filtering</a></div><div class="lev1"><a href="#Data-export"><span class="toc-item-num">6&nbsp;&nbsp;</span>Data export</a></div><div class="lev1"><a href="#DataFrame-aggregation"><span class="toc-item-num">7&nbsp;&nbsp;</span>DataFrame aggregation</a></div><div class="lev1"><a href="#Data-Merging"><span class="toc-item-num">8&nbsp;&nbsp;</span>Data Merging</a></div>

This notebook is to quickly repeat the most basic pandas operations prior to starting the practical course.
You should be able to quickly perform the following tasks before you start working on the exercises in the Day1 notebook. If you need to look up, how certain problems can be solved, have a look at the pandas [10 Minutes Introduction](http://pandas.pydata.org/pandas-docs/stable/10min.html), the [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html) and the lecture slides.

And here is a source for [Jupyter keyboard shortcuts](https://www.cheatography.com/weidadeyue/cheat-sheets/jupyter-notebook/) to help you format the notebooks in an efficient way.

# Import pandas, numpy, matplotlib and seaborn

In [1]:
# this will enable some additional autocompletion using the tab button

%config IPCompleter.greedy=True

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Create a Series object, access it's index and cells

Create a Series object representing the following measurements

| S   |
|-----|
| 1.0 |
| 1.5 |
| 3.0 |
| 4.3 |
| 8.2 |

In [3]:
pd.Series([1.0,1.5,3.0,4.3,8.2])

0    1.0
1    1.5
2    3.0
3    4.3
4    8.2
dtype: float64

# Create a DataFrame object, access its rows, columns, indices, cells

Create a dataframe of the following table.

|index   |a |b  |c   |d          |e |
|--------|--|---|----|-----------|--|
|1       |2 |3  |5.  |horse      |13|
|2       |3 |1  |1.4 |cat        |11|
|3       |4 |9  |1.2 |dog        |  |
|4       |5 |12 |0.8 |tortoise   |  |
|5       |6 |2  |2.3 |rabbit     |9 |

Now
* access the values of each row individually
* access single cells
* print the index and column names
* access values of each column individually
* rename columns
* extract rows 2-4 as new dataframe
* obtain summary table of dataframe

In [13]:
# preferably add a code block for each operation (e.g. by selecting a cell and pressing B on the keyboard)
index = np.arange(1,6)
df = pd.DataFrame({'a':np.arange(2,7),
                  'b':np.array([3,1,9,12,2]),
                   'c':np.array([5.,1.4,1.2,0.8,2.3]),
                   'd':np.array(['horse', 'cat', 'dog','tortoise', 'rabbit']),
                   'e':np.array([13,11,np.NaN ,np.NaN ,9])}, index = index)
df

   a   b    c         d     e
1  2   3  5.0     horse  13.0
2  3   1  1.4       cat  11.0
3  4   9  1.2       dog   NaN
4  5  12  0.8  tortoise   NaN
5  6   2  2.3    rabbit   9.0

In [40]:
#access values of rows
for i in range(1,6):
    print(df.loc[i])

a        2
b        3
c        5
d    horse
e       13
Name: 1, dtype: object
a      3
b      1
c    1.4
d    cat
e     11
Name: 2, dtype: object
a      4
b      9
c    1.2
d    dog
e    NaN
Name: 3, dtype: object
a           5
b          12
c         0.8
d    tortoise
e         NaN
Name: 4, dtype: object
a         6
b         2
c       2.3
d    rabbit
e         9
Name: 5, dtype: object

In [41]:
#access single cells
print(df.loc[3,'c'])
#same cell using iloc
print(df.iloc[2,2])
#another cell
print(df.loc[2,'d'])

1.2
1.2
cat

In [30]:
#Print index and column names
print('Index:', df.index)
print('Columns:',df.columns)

Index: Int64Index([1, 2, 3, 4, 5], dtype='int64')
Columns: Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [45]:
#Print columns
print('Column c:\n', df.loc[:,'c'])
print('Column a:\n', df.loc[:,'a'])

Column c:
 1    5.0
2    1.4
3    1.2
4    0.8
5    2.3
Name: c, dtype: float64
Column a:
 1    2
2    3
3    4
4    5
5    6
Name: a, dtype: int32

In [46]:
#Rename
df.rename(columns = {'a':'Moin', 'd':'Tach'})

   Moin   b    c      Tach     e
1     2   3  5.0     horse  13.0
2     3   1  1.4       cat  11.0
3     4   9  1.2       dog   NaN
4     5  12  0.8  tortoise   NaN
5     6   2  2.3    rabbit   9.0

In [49]:
#Extract rows 2 - 4 as df
df[1:4]

   a   b    c         d     e
2  3   1  1.4       cat  11.0
3  4   9  1.2       dog   NaN
4  5  12  0.8  tortoise   NaN

# Data Import

Import the following file into a dataframe _df2_:

Integrated_Bioinformatics/example_data/example_df.csv

In [101]:
df2 = pd.read_csv('../example_data/example_df.csv')
df2

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

Now import the following file into a pandas dataframe as _df3_. Do you need to change some parameters of the funtion?
Check whether the import makes sense by showing the dataframe

Integrated_Bioinformatics/example_data/example_df2.csv

In [263]:
df3 = pd.read_csv('../example_data/example_df2.csv', sep = ';')
df3

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

In [51]:
#Summary Table
df.describe()

              a          b         c     e
count  5.000000   5.000000  5.000000   3.0
mean   4.000000   5.400000  2.140000  11.0
std    1.581139   4.827007  1.690562   2.0
min    2.000000   1.000000  0.800000   9.0
25%    3.000000   2.000000  1.200000  10.0
50%    4.000000   3.000000  1.400000  11.0
75%    5.000000   9.000000  2.300000  12.0
max    6.000000  12.000000  5.000000  13.0

# DataFrame filtering
Using the dataframe created in section 3:

* select rows containing values greater than 2 in the 3rd column
* select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column
* drop rows with missing data
* drop duplicate rows
* drop 1st column from dataframe
* sort rows by 2nd column
* convert Strings in 4th column to title-case

In [229]:
#Values greater than 2 in 3rd column:
boos1 = df3.iloc[:,2] > 2
df3[boos1]

   a  b    c       d     e
0  2  3  5.0   Horse  13.0
4  6  2  2.3  Rabbit   9.0

In [231]:
#Values greater than 2 in 3rd column, other approach:
boos1 = df3.loc[df3.iloc[:,2] > 2]
#df3[boos1]
boos1

   a  b    c       d     e
0  2  3  5.0   Horse  13.0
4  6  2  2.3  Rabbit   9.0

In [113]:
#rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column
boos2 = df3.iloc[:,3] == 'cat'
df3[boos1 | boos2]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

In [76]:

import math
print(df.iloc[3,4])
math.isnan(df.iloc[3,4])

nan

True

In [114]:
#drop rows with missing data
boo3_all = [pd.notna(df3.iloc[i]) for i in range(5)]
boo3 = [boo3_all[i].all() for i in range(5)]
df3[boo3]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

In [119]:
#drop duplicates (which are not present)
df_drop = df3.drop_duplicates()
df_drop

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

In [123]:
#drop first row
df_drop = df3[1:len(df3)]
df_drop

   a   b    c         d     e
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

In [236]:
#drop first column
df3.drop('a', axis = 1)

    b    c         d     e
0   3  5.0     Horse  13.0
1   1  1.4       Cat  11.0
2   9  1.2       Dog   NaN
3  12  0.8  Tortoise   NaN
4   2  2.3    Rabbit   9.0

In [127]:
df_sorted = df3.sort_values(['b'])
df_sorted

   a   b    c         d     e
1  3   1  1.4       cat  11.0
4  6   2  2.3    rabbit   9.0
0  2   3  5.0     horse  13.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN

In [237]:
#capitalize d
str_series = df3.loc[:,'d']
str_series2 = str_series.str.capitalize()
df3.loc[:,'d'] = str_series2
df3

   a   b    c         d     e
0  2   3  5.0     Horse  13.0
1  3   1  1.4       Cat  11.0
2  4   9  1.2       Dog   NaN
3  5  12  0.8  Tortoise   NaN
4  6   2  2.3    Rabbit   9.0

In [250]:
#capitalize alternative approach from lecturer
'''
df['d'].apply(lambda x:x.capitalize())

same as:
def title2(input):
    return input.tilte()
df['d'].apply(title2)
'''

"\ndf['d'].apply(lambda x:x.capitalize())\n\nsame as:\ndef title2(input):\n    return input.tilte()\ndf['d'].apply(title2)\n"

# Data export

Export your filtered dataframe as a text file separated by tabs omitting the index column.

In [159]:
df.to_csv('filtered_df.txt', sep = '\t', index = [])

# DataFrame aggregation

Read in df4 from IntegratedBioinformatics/example_data/df4.csv

In [262]:
df4 = pd.read_csv('../example_data/df4.csv')
df4

         b    c         d     e
0   mammal  5.0     horse  13.0
1   mammal  1.4       cat  11.0
2   mammal  1.2       dog   NaN
3     fish  0.1  goldfish   NaN
4  reptile  2.3     snake   9.0
5     fish  1.8       koi  10.0
6     fish  0.8      carp   NaN

Using _df4_, group the data by column 'b'. Test different ways of aggregating the remaining columns as shown in the lecture.

In [212]:

df4.groupby(['b']).max()

           c      d     e
b
fish     1.8    koi  10.0
mammal   5.0  horse  13.0
reptile  2.3  snake   9.0

In [211]:
df4.groupby(['b']).mean()

                c     e
b
fish     0.900000  10.0
mammal   2.533333  12.0
reptile  2.300000   9.0

In [267]:
df4.groupby('b').agg({'c':np.max, 'e': np.mean})

           c     e
b
fish     1.8  10.0
mammal   5.0  12.0
reptile  2.3   9.0

# Data Merging

* Merge df3 with df4 on columns c, d and e. Change columns with same names in a meaningful way.

In [268]:
print(df3)
print(df4)
def add_to_col_name(df, add_str, except_col):
    #renames columns
    col = df.columns
    #new_col = [en + add_str for en in col]
    new_col = []
    for en in col:
        if en != except_col:
            new_col.append(en + add_str)
        else :
            new_col.append(en)
    df.columns = new_col
    
add_to_col_name(df3, '3', 'd')
add_to_col_name(df4, '4', 'd')

df4.merge(df3, left_on='d', right_on='d')

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0
         b    c         d     e
0   mammal  5.0     horse  13.0
1   mammal  1.4       cat  11.0
2   mammal  1.2       dog   NaN
3     fish  0.1  goldfish   NaN
4  reptile  2.3     snake   9.0
5     fish  1.8       koi  10.0
6     fish  0.8      carp   NaN

       b4   c4      d    e4  a3  b3   c3    e3
0  mammal  5.0  horse  13.0   2   3  5.0  13.0
1  mammal  1.4    cat  11.0   3   1  1.4  11.0
2  mammal  1.2    dog   NaN   4   9  1.2   NaN

* Now perform a full outer join of the data, to keep all rows contained in either of the two dataframes.

In [270]:
#reloading d3 and d4
df4 = pd.read_csv('../example_data/df4.csv')
df4
df3 = pd.read_csv('../example_data/example_df2.csv', sep = ';')
df3

add_to_col_name(df3, '3', 'd')
add_to_col_name(df4, '4', 'd')

df4.merge(df3, on = 'd', how = 'outer')

        b4   c4         d    e4   a3    b3   c3    e3
0   mammal  5.0     horse  13.0  2.0   3.0  5.0  13.0
1   mammal  1.4       cat  11.0  3.0   1.0  1.4  11.0
2   mammal  1.2       dog   NaN  4.0   9.0  1.2   NaN
3     fish  0.1  goldfish   NaN  NaN   NaN  NaN   NaN
4  reptile  2.3     snake   9.0  NaN   NaN  NaN   NaN
5     fish  1.8       koi  10.0  NaN   NaN  NaN   NaN
6     fish  0.8      carp   NaN  NaN   NaN  NaN   NaN
7      NaN  NaN  tortoise   NaN  5.0  12.0  0.8   NaN
8      NaN  NaN    rabbit   NaN  6.0   2.0  2.3   9.0